---
kind: method
id: M:Autodesk.Revit.DB.TemporaryGraphicsManager.Dispose
source: html/af31a45b-fb8d-b6ab-e57a-7e04f9645540.htm
---
# Autodesk.Revit.DB.TemporaryGraphicsManager.Dispose Method

Releases all resources used by the TemporaryGraphicsManager

## Syntax (C#)
```csharp
public void Dispose()
```